; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_3 ?v1 - type_1 ?v6 - type_2)
 	      (pred_4 ?v7 - object ?v6 - type_2)
	      (pred_2 ?v1 - type_1 ?v4 - type_3)
	      (pred_1 ?v1 - type_1 ?v7 - object ?v4 - type_3))

   (:action op_3
       :parameters  (?v1 - type_1 ?v2 ?v5 - type_2)
       :precondition (and  (pred_3 ?v1 ?v2))
       :effect (and  (pred_3 ?v1 ?v5)
		     (not (pred_3 ?v1 ?v2))))

   (:action op_2
       :parameters (?v1 - type_1 ?v3 - object ?v8 - type_2 ?v4 - type_3)
       :precondition  (and  (pred_4 ?v3 ?v8) (pred_3 ?v1 ?v8) (pred_2 ?v1 ?v4))
       :effect (and (pred_1 ?v1 ?v3 ?v4)
		    (not (pred_4 ?v3 ?v8)) 
		    (not (pred_2 ?v1 ?v4))))

   (:action op_1
       :parameters (?v1 - type_1 ?v3 - object ?v8 - type_2 ?v4 - type_3)
       :precondition  (and  (pred_1 ?v1 ?v3 ?v4) (pred_3 ?v1 ?v8))
       :effect (and (pred_4 ?v3 ?v8)
		    (pred_2 ?v1 ?v4)
		    (not (pred_1 ?v1 ?v3 ?v4)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_09 - type_1
obj_04 obj_06 - type_3
obj_01 obj_05 obj_03 obj_08 - type_2
obj_07 obj_02 obj_10 - object)
(:init
(pred_3 obj_09 obj_05)
(pred_2 obj_09 obj_04)
(pred_2 obj_09 obj_06)
(pred_4 obj_07 obj_03)
(pred_4 obj_02 obj_05)
(pred_4 obj_10 obj_05)
)
(:goal
(and
(pred_4 obj_07 obj_01)
(pred_4 obj_02 obj_03)
(pred_4 obj_10 obj_08)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_1 obj_09 ?b obj_06))))
)
)

; plan
1. (op_2 obj_09 obj_02 obj_05 obj_04)
   deleted: (pred_4 obj_02 obj_05) (pred_2 obj_09 obj_04)
   added: (pred_1 obj_09 obj_02 obj_04)
   goals met: 0 of 3
2. (op_3 obj_09 obj_05 obj_03)
   deleted: (pred_3 obj_09 obj_05)
   added: (pred_3 obj_09 obj_03)
   goals met: 0 of 3
3. (op_1 obj_09 obj_02 obj_03 obj_04)
   deleted: (pred_1 obj_09 obj_02 obj_04)
   added: (pred_4 obj_02 obj_03) (pred_2 obj_09 obj_04)
   goals met: 1 of 3
4. (op_2 obj_09 obj_07 obj_03 obj_04)
   deleted: (pred_4 obj_07 obj_03) (pred_2 obj_09 obj_04)
   added: (pred_1 obj_09 obj_07 obj_04)
   goals met: 1 of 3
5. (op_3 obj_09 obj_03 obj_01)
   deleted: (pred_3 obj_09 obj_03)
   added: (pred_3 obj_09 obj_01)
   goals met: 1 of 3
6. (op_1 obj_09 obj_07 obj_01 obj_04)
   deleted: (pred_1 obj_09 obj_07 obj_04)
   added: (pred_4 obj_07 obj_01) (pred_2 obj_09 obj_04)
   goals met: 2 of 3
7. (op_3 obj_09 obj_01 obj_05)
   deleted: (pred_3 obj_09 obj_01)
   added: (pred_3 obj_09 obj_05)
   goals met: 2 of 3
8. (op_2 obj_09 obj_10 obj_05 obj_04)
   deleted: (pred_4 obj_10 obj_05) (pred_2 obj_09 obj_04)
   added: (pred_1 obj_09 obj_10 obj_04)
   goals met: 2 of 3
9. (op_3 obj_09 obj_05 obj_08)
   deleted: (pred_3 obj_09 obj_05)
   added: (pred_3 obj_09 obj_08)
   goals met: 2 of 3
10. (op_1 obj_09 obj_10 obj_08 obj_04)
   deleted: (pred_1 obj_09 obj_10 obj_04)
   added: (pred_4 obj_10 obj_08) (pred_2 obj_09 obj_04)
   goals met: 3 of 3
